app/views/tweets/_form.html.erb

SELECT "users".* FROM "users"
---
        <option class="default"></option>
        <% User.all.each do |user| %>